ProyectoFinal-G1-Santiago/weather-site/public/mult-ieee754.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-07-16 Thu 00:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multiplicación - IEEE754</title>
<meta name="author" content="Emilio Albán, Ariel Montufar, Karen Suarez, Samuel Churaco" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Multiplicación - IEEE754</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org09b80aa">1. ÍNDICE DE LA PÁGINA</a></li>
<li><a href="#1-introducción">2. 1. INTRODUCCIÓN</a>
<ul>
<li><a href="#org2cfb224">2.1. ¿Qué es el estándar IEEE 754?</a></li>
<li><a href="#org8cec307">2.2. ¿Para qué sirve?</a></li>
<li><a href="#org193c8f3">2.3. ¿Por qué se utiliza?</a></li>
</ul>
</li>
<li><a href="#2-representación-ieee-754">3. 2. REPRESENTACIÓN IEEE 754</a>
<ul>
<li><a href="#org5c6769b">3.1. Ilustración del Formato de Memoria (32 bits)</a></li>
<li><a href="#org9a4549d">3.2. Fórmula general de representación IEEE 754</a></li>
<li><a href="#orga5681aa">3.3. Explicación de los Componentes Esenciales</a></li>
</ul>
</li>
<li><a href="#3-multiplicación-ieee-754">4. 3. MULTIPLICACIÓN IEEE 754 (ALGORITMO PASO A PASO)</a>
<ul>
<li><a href="#org760080d">4.1. Paso 1: Multiplicación de Signos</a></li>
<li><a href="#org5b985ae">4.2. Paso 2: Suma de Exponentes y Ajuste del Sesgo</a></li>
<li><a href="#org3657373">4.3. Paso 3: Multiplicación de las Mantisas</a></li>
<li><a href="#org5907f4d">4.4. Paso 4: Normalización del Resultado</a></li>
<li><a href="#org0332c4d">4.5. Paso 5: Redondeo y Ensamblaje del Resultado Final</a></li>
</ul>
</li>
<li><a href="#4-ejemplo-desarrollado">5. 4. EJEMPLO DESARROLLADO</a>
<ul>
<li><a href="#org28d837f">5.1. Paso 1: Conversión a IEEE 754</a></li>
<li><a href="#org34852d1">5.2. Paso 2: Operación del algoritmo</a></li>
<li><a href="#org38685ab">5.3. Paso 3: Resultado final</a></li>
</ul>
</li>
<li><a href="#5-conclusiones">6. 5. CONCLUSIONES</a></li>
<li><a href="#6-referencias">7. 6. REFERENCIAS</a></li>
</ul>
</div>
</div>

<div id="outline-container-org09b80aa" class="outline-2">
<h2 id="org09b80aa"><span class="section-number-2">1.</span> ÍNDICE DE LA PÁGINA</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="#1-introducción">1. Introducción</a>
<ul class="org-ul">
<li>¿Qué es el estándar IEEE 754?</li>
<li>¿Para qué sirve?</li>
<li>¿Por qué se utiliza?</li>
</ul></li>
<li><a href="#2-representación-ieee-754">2. Representación IEEE 754</a>
<ul class="org-ul">
<li>Bit de signo</li>
<li>Exponente</li>
<li>Mantisa</li>
<li>Ilustración del formato</li>
</ul></li>
<li><a href="#3-multiplicación-ieee-754">3. Multiplicación IEEE 754 (Algoritmo Paso a Paso)</a>
<ul class="org-ul">
<li>Multiplicación de signos</li>
<li>Suma de exponentes</li>
<li>Multiplicación de mantisas</li>
<li>Normalización</li>
<li>Resultado final</li>
</ul></li>
<li><a href="#4-ejemplo-desarrollado">4. Ejemplo Desarrollado</a>
<ul class="org-ul">
<li>Número A y Número B</li>
<li>Conversión, Operación y Resultado</li>
</ul></li>
<li><a href="#5-conclusiones">5. Conclusiones</a></li>
<li><a href="#6-referencias">6. Bibliografía</a></li>
</ul>

<hr />
</div>
</div>
<div id="outline-container-1-introducción" class="outline-2">
<h2 id="1-introducción"><span class="section-number-2">2.</span> 1. INTRODUCCIÓN</h2>
<div class="outline-text-2" id="text-1-introducción">
<p>
En esta sección se explica el funcionamiento de la multiplicación de números representados mediante el estándar IEEE 754. Para comprender
este proceso, primero se presenta una breve revisión sobre este formato, su propósito y la manera en que los computadores representan
números de punto flotante.
</p>
</div>

<div id="outline-container-org2cfb224" class="outline-3">
<h3 id="org2cfb224"><span class="section-number-3">2.1.</span> ¿Qué es el estándar IEEE 754?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
El estándar IEEE 754, desarrollado por el Instituto de Ingenieros Eléctricos y Electrónicos (IEEE), establece una representación uniforme
para almacenar y procesar números reales dentro de los sistemas computacionales. Su principal objetivo es permitir que diferentes arquitecturas
de hardware y lenguajes de programación puedan realizar operaciones matemáticas de forma consistente, evitando cualquier tipo de diferencias
o malentendidos en la interpretación de los valores numéricos.
</p>
</div>
</div>

<div id="outline-container-org8cec307" class="outline-3">
<h3 id="org8cec307"><span class="section-number-3">2.2.</span> ¿Para qué sirve?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Este formato sirve esencialmente como una regla técnica universal en el mundo de la informática. En el día a día, permite que cálculos
extremadamente complejos —como el renderizado de los gráficos de un videojuego, la simulación física en un software de ingeniería o el
procesamiento de datos científicos— se ejecuten de manera predecible y con un margen de error estrictamente controlado, garantizando la
portabilidad total del software entre distintos sistemas operativos y procesadores.
</p>
</div>
</div>

<div id="outline-container-org193c8f3" class="outline-3">
<h3 id="org193c8f3"><span class="section-number-3">2.3.</span> ¿Por qué se utiliza?</h3>
<div class="outline-text-3" id="text-2-3">
<p>
La razón fundamental por la que se utiliza este estándar radica en la naturaleza binaria de las computadoras. Como el hardware interno de
los procesadores solo entiende ceros y unos, representar números con decimales de forma directa mediante métodos tradicionales de punto fijo
resulta sumamente ineficiente y provoca pérdidas masivas de precisión aritmética. El estándar IEEE 754 soluciona este dilema al implementar
un sistema equivalente a la notación científica binaria, lo que optimiza al máximo el uso de la memoria física y ofrece un equilibrio perfecto
entre el rango de los números que se pueden representar y la exactitud de sus decimales.
</p>

<hr />
</div>
</div>
</div>


<div id="outline-container-2-representación-ieee-754" class="outline-2">
<h2 id="2-representación-ieee-754"><span class="section-number-2">3.</span> 2. REPRESENTACIÓN IEEE 754</h2>
<div class="outline-text-2" id="text-2-representación-ieee-754">
<p>
Para comprender cómo se realiza una multiplicación bajo este estándar, primero es indispensable examinar cómo se almacena un número real dentro
de la memoria física de una computadora. El estándar organiza la información dividiendo los bits disponibles en tres secciones perfectamente
delimitadas. A continuación, se presenta la estructura física para el formato de precisión simple (32 bits):
</p>
</div>

<div id="outline-container-org5c6769b" class="outline-3">
<h3 id="org5c6769b"><span class="section-number-3">3.1.</span> Ilustración del Formato de Memoria (32 bits)</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-text">  31  30          23 22                                   0
 +---+--------------+---------------------------------------+
 | S |  Exponente   |                Mantisa                |
 +---+--------------+---------------------------------------+
   |        |                           |
   |        v                           v
   |    (8 bits)                    (23 bits)
   v    Define el tama&#241;o            Guarda los d&#237;gitos reales
 Signo  (mueve el punto).           (Posee un '1.' oculto)
(0 o 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a4549d" class="outline-3">
<h3 id="org9a4549d"><span class="section-number-3">3.2.</span> Fórmula general de representación IEEE 754</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Un número en formato IEEE 754 se interpreta mediante la expresión:
</p>

<div class="org-center">
<p>
(-1)<sup>S</sup> × 1.M × 2<sup>(E - Bias)</sup>
</p>
</div>

<p>
Donde:
</p>

<ul class="org-ul">
<li>S representa el bit de signo.</li>
<li>M representa la mantisa.</li>
<li>E representa el exponente almacenado.</li>
<li>Bias corresponde al sesgo utilizado para representar exponentes negativos.</li>
</ul>
</div>
</div>
