ProyectoFinal-G1-Santiago/weather-site/public/mult-ieee754.html

<div id="outline-container-orga5681aa" class="outline-3">
<h3 id="orga5681aa"><span class="section-number-3">3.3.</span> Explicación de los Componentes Esenciales</h3>
<div class="outline-text-3" id="text-3-3">
<blockquote>
<p>
<b><b>Bit de Signo (S):</b></b>
Ubicado en la posición más significativa (el bit 31 a la extrema izquierda), este componente determina el sentido del valor. Al ser un único bit,
solo puede adoptar dos estados: un valor de <code>0</code> indica estrictamente que el número es positivo, mientras que un valor de <code>1</code> establece que la
cantidad es negativa. En la multiplicación, este bit se procesa de forma independiente al resto de los datos.
</p>
</blockquote>

<div class="NOTE" id="org9d96a07">
<p>
<b><b>Exponente (8 bits):</b></b>
Este bloque se encarga de definir la escala, magnitud o tamaño del número, determinando cuántas posiciones debe desplazarse el punto decimal en
binario. Debido a que los números reales pueden ser extremadamente grandes o microscópicos, el exponente necesita ser capaz de representar valores
tanto positivos como negativos. Para lograr esto sin complicar el hardware del procesador, el estándar aplica un <b><b>sesgo (bias) de 127</b></b>.
Esto significa que el valor real del exponente matemático se le suma siempre 127 antes de guardarlo en la memoria.
</p>

</div>

<blockquote>
<p>
<b><b>Mantisa o Significando (23 bits):</b></b>
Este componente almacena los dígitos significativos o la precisión real de la cantidad numérica. Para optimizar el espacio físico en los chips, el
estándar utiliza un ingenioso truco matemático: dado que cualquier número binario normalizado siempre empieza con un dígito igual a <code>1</code>
(por ejemplo, \(1.01011_2\)), <b><b>ese "1." inicial se vuelve implícito u oculto</b></b>. La computadora no lo escribe en el bloque de 23 bits de la memoria,
sino que el procesador lo añade de forma automática al realizar las operaciones aritméticas, permitiendo ganar un bit extra de precisión de forma
completamente gratuita.
</p>
</blockquote>

<hr />
</div>
</div>
</div>

<div id="outline-container-3-multiplicación-ieee-754" class="outline-2">
<h2 id="3-multiplicación-ieee-754"><span class="section-number-2">4.</span> 3. MULTIPLICACIÓN IEEE 754 (ALGORITMO PASO A PASO)</h2>
<div class="outline-text-2" id="text-3-multiplicación-ieee-754">
<p>
El procedimiento para multiplicar dos números en el estándar IEEE 754 difiere significativamente de la suma aritmética. En este caso,
el procesador no necesita realizar un alineamiento previo de los puntos decimales ni alterar las escalas de los números. En su lugar, el
hardware descompone los factores y ejecuta de forma paralela un algoritmo estricto estructurado en cinco etapas fundamentales.
</p>
</div>

<div id="outline-container-org760080d" class="outline-3">
<h3 id="org760080d"><span class="section-number-3">4.1.</span> Paso 1: Multiplicación de Signos</h3>
<div class="outline-text-3" id="text-4-1">
<p>
La determinación del signo del resultado final es la operación más rápida del proceso. El procesador extrae de forma independiente los bits de
signo (posición 31) de ambos factores y les aplica una función lógica <b><b>XOR</b></b> (O exclusivo), la cual obedece de manera exacta a la ley de los
signos tradicional.
</p>
<ul class="org-ul">
<li>Si los dos factores poseen signos idénticos (ambos positivos <code>0</code> o ambos negativos <code>1</code>), la compuerta lógica devuelve un bit <code>0</code>, estableciendo
que el resultado final será positivo.</li>
<li>Si los factores cuentan con signos opuestos (uno positivo y otro negativo), la operación devuelve un bit <code>1</code>, decretando que el resultado es
negativo.</li>
</ul>
</div>
</div>

<div id="outline-container-org5b985ae" class="outline-3">
<h3 id="org5b985ae"><span class="section-number-3">4.2.</span> Paso 2: Suma de Exponentes y Ajuste del Sesgo</h3>
<div class="outline-text-3" id="text-4-2">
<p>
En esta etapa, el procesador calcula la magnitud del nuevo número sumando los exponentes de ambos factores. Sin embargo, surge un inconveniente
físico: como explicamos en la sección anterior, cada exponente ya viene almacenado con un sesgo de \(+127\) de fábrica. Al sumarlos directamente,
el sesgo se añadiría dos veces (\(127 + 127 = 254\)), descalibrando por completo la escala real. 
Para corregir este exceso, el algoritmo ejecuta una resta aritmética restando el valor del sesgo (\(127\)) una sola vez al total acumulado. La
fórmula matemática exacta que ejecuta el chip es:
\[\text{Exponente Provisional} = \text{Exponente}_1 + \text{Exponente}_2 - 127\]
</p>
</div>
</div>

<div id="outline-container-org3657373" class="outline-3">
<h3 id="org3657373"><span class="section-number-3">4.3.</span> Paso 3: Multiplicación de las Mantisas</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Antes de efectuar la operación matemática, la unidad de punto flotante del procesador realiza una reconstrucción obligatoria: toma los 23 bits
de la mantisa de cada factor y les reinyecta a la izquierda el dígito implícito <code>1.</code> que se había ocultado para ahorrar espacio en la memoria. 
Una vez que se tienen las dos mantisas completas (que ahora lucen de la forma \(1.xxxx\)), el procesador las multiplica linealmente utilizando el
algoritmo de multiplicación para números enteros binarios. El resultado de esta multiplicación de fracciones binarias generará una mantisa
provisional significativamente más larga, la cual contiene la combinación de la precisión de ambos factores.
</p>
</div>
</div>

<div id="outline-container-org5907f4d" class="outline-3">
<h3 id="org5907f4d"><span class="section-number-3">4.4.</span> Paso 4: Normalización del Resultado</h3>
<div class="outline-text-3" id="text-4-4">
<p>
El estándar exige rigurosamente que el resultado se almacene bajo el formato de notación científica binaria limpia, lo que significa que
<b><b>solo debe existir un único dígito "1" antes del punto decimal</b></b> (formato estricto de \(1.xxxxx\)). Debido a la multiplicación del paso anterior,
el resultado puede desbordarse hacia la izquierda, devolviendo un valor que inicie por ejemplo con dos dígitos antes del punto
(como \(11.010_2\) o \(10.111_2\)).
Si esto ocurre, el procesador desplaza geométricamente el punto decimal una posición hacia la izquierda para forzar el formato correcto (\(1.xxxx\)).
Para contrarrestar matemáticamente este movimiento del punto y mantener el valor numérico intacto, el hardware compensa la operación
<b><b>sumando un +1 al Exponente Provisional</b></b> que calculamos en el Paso 2. Si el resultado de la multiplicación ya iniciaba con un solo dígito <code>1.</code>,
la normalización no es necesaria y el exponente se mantiene igual.
</p>
</div>
</div>

<div id="outline-container-org0332c4d" class="outline-3">
<h3 id="org0332c4d"><span class="section-number-3">4.5.</span> Paso 5: Redondeo y Ensamblaje del Resultado Final</h3>
<div class="outline-text-3" id="text-4-5">
<p>
En la fase de cierre, el procesador prepara los datos para inyectarlos de vuelta en la celda de memoria de 32 bits. Primero, se aplica el filtro
de redondeo: si la mantisa resultante de la multiplicación superó los 23 bits de capacidad física del formato, los bits sobrantes del extremo
derecho se recortan o se ajustan según el modo de redondeo configurado en el sistema (por ejemplo, aproximando al valor más cercano).
Finalmente, el rompecabezas se ensambla en el registro físico:
</p>
<ol class="org-ol">
<li>Se coloca el bit de signo determinado en el Paso 1.</li>
<li>Se inyecta el Exponente Final corregido en el Paso 4.</li>
<li>Se toma la mantisa normalizada y redondeada, <b><b>se le remueve nuevamente el dígito "1." implícito</b></b> para ahorrar espacio, y se rellenan los
23 bits restantes de la memoria de la computadora.</li>
</ol>

<p>
&#x2014;
</p>
</div>
</div>
</div>

<div id="outline-container-4-ejemplo-desarrollado" class="outline-2">
<h2 id="4-ejemplo-desarrollado"><span class="section-number-2">5.</span> 4. EJEMPLO DESARROLLADO</h2>
<div class="outline-text-2" id="text-4-ejemplo-desarrollado">
<p>
Vamos a multiplicar <b>A = -5.25</b> por <b>B = 3.75</b>.
</p>
</div>
