ProyectoFinal-G1-Santiago/weather-site/public/mult-ieee754.html

<div id="outline-container-org28d837f" class="outline-3">
<h3 id="org28d837f"><span class="section-number-3">5.1.</span> Paso 1: Conversión a IEEE 754</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><b>Número A (-5.25):</b>
<ul class="org-ul">
<li>Binario: La parte entera 5 es \(101_2\) y la fraccionaria 0.25 es \(0.01_2\). Total: \(-101.01_2\).</li>
<li>Normalización: \(-1.0101_2 \times 2^2\)</li>
<li>Signo: <code>1</code> (Negativo)</li>
<li>Exponente: El exponente real es 2. Le sumamos el sesgo (127): \(2 + 127 = 129 = 10000001_2\)</li>
<li>Mantisa (quitando el "1."): <code>01010000000000000000000</code></li>
</ul></li>

<li><b>Número B (3.75):</b>
<ul class="org-ul">
<li>Binario: La parte entera 3 es \(11_2\) y la fraccionaria 0.75 es \(0.11_2\). Total: \(11.11_2\).</li>
<li>Normalización: \(1.111_2 \times 2^1\)</li>
<li>Signo: <code>0</code> (Positivo)</li>
<li>Exponente: El exponente real es 1. Le sumamos el sesgo (127): \(1 + 127 = 128 = 10000000_2\)</li>
<li>Mantisa (quitando el "1."): <code>11100000000000000000000</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org34852d1" class="outline-3">
<h3 id="org34852d1"><span class="section-number-3">5.2.</span> Paso 2: Operación del algoritmo</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li><b>Multiplicación de signos:</b> \(1 \oplus 0 = 1\) (El resultado será negativo).</li>
<li><b>Suma de exponentes:</b> \(129 + 128 - 127 = 130\) (<code>10000010</code> en binario).</li>
<li><p>
<b>Multiplicación de mantisas:</b> Tomamos las mantisas con su "1." implícito: \(1.0101_2 \times 1.111_2\). 
Para multiplicar, ignoramos la coma temporalmente y multiplicamos \(10101 \times 1111\):
</p>
<pre class="example" id="org7b341ad">
    10101
  x  1111
  -------
    10101
   101010
  1010100
 10101000
 --------
100111011
</pre>
<p>
El primer número tiene 4 decimales y el segundo tiene 3. En total son 7 posiciones decimales. Colocamos la coma: \(10.0111011_2\).
</p></li>
<li><b>Normalización:</b> El resultado de la mantisa es \(10.0111011_2\). Como hay dos dígitos antes del punto (es mayor a 2.0), no está normalizado. 
<ul class="org-ul">
<li>Movemos la coma una posición a la izquierda: \(1.00111011_2\).</li>
<li>Como movimos la coma a la izquierda, <b>debemos sumar 1 al exponente</b> calculado en el paso 2: \(130 + 1 = 131\).</li>
<li>El nuevo exponente en binario es: <code>10000011</code>.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org38685ab" class="outline-3">
<h3 id="org38685ab"><span class="section-number-3">5.3.</span> Paso 3: Resultado final</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Concatenamos las partes calculadas:
</p>
<ul class="org-ul">
<li>Signo: <code>1</code></li>
<li>Exponente: <code>10000011</code></li>
<li>Mantisa (quitando el "1." inicial y rellenando con ceros hasta 23 bits): <code>00111011000000000000000</code></li>
</ul>

<p>
<b>Resultado final en binario IEEE 754:</b>
<code>1 10000011 00111011000000000000000</code>
</p>

<p>
<b>Comprobación matemática:</b>
Si reconstruimos el número: Signo negativo, Exponente \(131 - 127 = 4\). Mantisa \(1.00111011_2\).
Valor: \(-1.00111011_2 \times 2^4 = -10011.1011_2\).
La parte entera \(10011_2 = 19_{10}\). La parte fraccionaria \(0.1011_2 = 0.5 + 0.125 + 0.0625 = 0.6875_{10}\). 
Total: \(-19.6875\). (Lo cual es exactamente \(-5.25 \times 3.75\)).
&#x2014;
</p>
</div>
</div>
</div>
<div id="outline-container-5-conclusiones" class="outline-2">
<h2 id="5-conclusiones"><span class="section-number-2">6.</span> 5. CONCLUSIONES</h2>
<div class="outline-text-2" id="text-5-conclusiones">
<ol class="org-ol">
<li>La separación de signo, exponente y mantisa permite que la multiplicación de números de punto flotante se resuelva
utilizando sumadores y multiplicadores enteros en el hardware, lo que hace el proceso extremadamente rápido.</li>

<li>El uso de un exponente sesgado (bias) simplifica la circuitería, ya que evita tener que
diseñar comparadores o sumadores especiales para exponentes con signo.</li>

<li>La normalización es un paso crítico, ya que garantiza que el estándar mantenga la máxima
precisión posible en los 23 bits de la mantisa en cada operación.</li>
</ol>
<p>
&#x2014;
</p>
</div>
</div>
<div id="outline-container-6-referencias" class="outline-2">
<h2 id="6-referencias"><span class="section-number-2">7.</span> 6. REFERENCIAS</h2>
<div class="outline-text-2" id="text-6-referencias">
<ul class="org-ul">
<li>Stallings, W. (2006). <i>Organización y Arquitectura de Computadores: Diseño para optimizar prestaciones</i> (7ma ed., p. 328). Pearson Prentice Hall.</li>
<li>Numeral Systems. (s.f.). <i>IEEE-754 floating-point multiplication</i>. Recuperado de: <a href="https://numeral-systems.com/ieee-754-multiply/">https://numeral-systems.com/ieee-754-multiply/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-07-14</p>
<p class="author">Author: Emilio Albán, Ariel Montufar, Karen Suarez, Samuel Churaco</p>
<p class="date">Created: 2026-07-16 Thu 00:51</p>
</div>
</body>
</html>
